import base64
import json
from time import sleep
import csv
from itertools import chain

import requests

START_CONVERSION_URL = "http://api.convertio.co/convert"
API_KEY = "608745a3c9efe0236d0369f591d304ee"
GET_CONVERSION_STATUS_URL = "https://api.convertio.co/convert/{id}/status"
GET_CONVERTED_FILE_URL = "https://api.convertio.co/convert/{id}/dl"
SLEEP_TIME = 10

level_1_destination_delimiter = '^level_1^'
level_2_destination_delimiter = '^level_2^'
to_replace = {"Актуальна інформація про об’єкт нерухомого майна": level_1_destination_delimiter,
              "ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА": level_1_destination_delimiter,
              "Відомості про права власності": level_2_destination_delimiter,
              "ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ": level_2_destination_delimiter,
              "Дата внесення запису": level_2_destination_delimiter + "Дата внесення запису",
              }

main_info_starts = ["Реєстраційний номер", ]
own_info_starts = ["Дата внесення запису", "Номер запису про право власності / довірчої власності"]
skippers = ['стор.', 'RRP-', 'ВІДОМОСТІ',"З РЕЄСТРУ ПРАВ ВЛАСНОСТІ НА НЕРУХОМЕ МАЙНО"]

key_substitution = {"Реєстраційний номер об’єкта нерухомого майна:": "Реєстраційний номер майна:",
                    "Об’єкт нерухомого майна:": "Тип майна:",
                    "Загальна площа (кв.м):": "Площа:",
                    "Адреса нерухомого майна:": "Адреса:"
                    }

csv_keys = list(key_substitution.values())
csv_keys.append("Власники")

test_data = """    Інформація з Державного реєстру речових прав на нерухоме майно та його архівної
                   складової частини щодо об’єкта нерухомого майна
                          (Щодо багатоквартирного будинку)

Номер інформаційної       235853921
довідки:
Дата, час формування:     08.12.2020 09:42:52
Інформаційну довідку      Мазур Наталія Іванівна, Департамент адміністративних послуг та
сформовано:               дозвільних процедур Дніпровської міської ради, Дніпропетровська
                          обл.
Підстава формування       заява з реєстраційним номером: 42962895, дата і час реєстрації заяви:
інформаційної довідки:    08.12.2020 09:41:01, заявник: Дроненко Віктор Анатолійович

                                     Параметри запиту
Пошук в Державному        права власності
реєстрі речових прав на
нерухоме майно про:
Адреса /                  Дніпропетровська обл., м. Дніпро, проспект Слобожанський, будинок
Місцезнаходження:         64

                               ВІДОМОСТІ
         З ДЕРЖАВНОГО РЕЄСТРУ РЕЧОВИХ ПРАВ НА НЕРУХОМЕ МАЙНО

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      1908554612101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 42.5, житлова площа (кв.м): 25.4
Адреса:                  Дніпропетровська обл., м. Дніпро, проспект Слобожанський, будинок
                         64, квартира 30

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 33107923
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1/1
Власники:               Некрасова Катерина Вікторівна

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      1841789112101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 45.8, житлова площа (кв.м): 28.7
Адреса:                  Дніпропетровська обл., м. Дніпро, проспект Слобожанський, будинок
                         64, квартира 18




                                                                                          RRP-4HINQBNHS
                             Відомості про права власності
Номер запису про право власності / довірчої власності: 31794722
Тип права власності:    Право власності
Форма власності:        приватна
Вид спільної власності: спільна часткова
Розмір частки:          1/2
Власники:               КРЮЧКОВА ТЕТЯНА МИКОЛАЇВНА

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      1514882312101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 54.8, житлова площа (кв.м): 37.4
Адреса:                  Дніпропетровська обл., м. Дніпро, проспект Слобожанський, будинок
                         64, квартира 4

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 25406184
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1/1
Власники:               Нужна Альона Володимирівна

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      1503187212101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 42.2, житлова площа (кв.м): 27.4
Адреса:                  Дніпропетровська обл., м. Дніпро, проспект Слобожанський, будинок
                         64, квартира 26

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 25177686
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1/1
Власники:               Копил Олена Олександрівна

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      1217599412101
об’єкта нерухомого
майна:
                                        стор. 2 з 13



                                                                                     RRP-4HINQBNHS
Об’єкт нерухомого         квартира
майна:
Площа:                    Загальна площа (кв.м): 46.5, житлова площа (кв.м): 27.9
Адреса:                   Дніпропетровська обл., м. Дніпро, проспект Слобожанський, будинок
                          64, квартира 27

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 22220415
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1
Власники:               КОБЗАР ЮЛІЯ ВІКТОРІВНА

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      1080121412101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 44.6, житлова площа (кв.м): 29.7
Адреса:                  Дніпропетровська обл., м. Дніпро, проспект Слобожанський, будинок
                         64, квартира 36

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 17355599
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1/1
Власники:               Кравцова Тетяна Миколаївна

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      969781712101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 55, житлова площа (кв.м): 37.8
Адреса:                  Дніпропетровська обл., м. Дніпропетровськ, проспект
                         Слобожанський, будинок 64, квартира 8

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 38074383
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1
Власники:               Реброва Світлана Миколаївна

                                          стор. 3 з 13



                                                                                      RRP-4HINQBNHS
                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      896155912101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 41.1, житлова площа (кв.м): 24.7
Адреса:                  Дніпропетровська обл., м. Дніпропетровськ, проспект
                         Слобожанський, будинок 64, квартира 3

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 14060785
Тип права власності:    Право власності
Форма власності:        приватна
Вид спільної власності: спільна часткова
Розмір частки:          30/100
Власники:               Шитіков Іван Михайлович

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      602621312101
об’єкта нерухомого
майна:
Об’єкт нерухомого        нежитлове приміщення
майна:
Площа:                   Загальна площа (кв.м): 44.2
Адреса:                  Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
                         "Правда", будинок 64, приміщення 23

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 9130476
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1/1
Власники:               Кукушкін Юрій Сергійович

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      578357512101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 44.1, житлова площа (кв.м): 28
Адреса:                  Дніпропетровська обл., м. Дніпро, проспект Слобожанський, будинок
                         64, квартира 1

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 28733766
                                        стор. 4 з 13



                                                                                      RRP-4HINQBNHS
Тип права власності:      Право власності
Форма власності:          приватна
Розмір частки:            1/1
Власники:                 Колтунова Світлана Борисівна

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      514723912101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 44.3, житлова площа (кв.м): 24.2
Адреса:                  Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
                         "Правда", будинок 64, квартира 32

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 7880867
Тип права власності:    Право власності
Форма власності:        приватна
Вид спільної власності: спільна часткова
Розмір частки:          1/2
Власники:               Гуменюк Валерія Ігорівна

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      332866312101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 56.4, житлова площа (кв.м): 38
Адреса:                  Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
                         "Правда", будинок 64, квартира 37

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 5261079
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1
Власники:               Іващенко Тетяна Петрівна

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      140504212101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 44.4, житлова площа (кв.м): 27.2
                                          стор. 5 з 13



                                                                                      RRP-4HINQBNHS
Адреса:                  Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
                         "Правда", будинок 64, квартира 9

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 2230835
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1
Власники:               Щербина Світлана Анатоліївна

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      51085012101
об’єкта нерухомого
майна:
Об’єкт нерухомого        квартира
майна:
Площа:                   Загальна площа (кв.м): 43.4, житлова площа (кв.м): 28.1
Адреса:                  Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
                         "Правда", будинок 64, квартира 13

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 883917
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1/1
Власники:               Непевний Максим Аркадійович

                    Актуальна інформація про об’єкт нерухомого майна
Реєстраційний номер      1701312101
об’єкта нерухомого
майна:
Об’єкт нерухомого        нежитлове приміщення
майна:
Площа:                   Загальна площа (кв.м): 45
Адреса:                  Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
                         "Правда", будинок 64, приміщення 2

                             Відомості про права власності
Номер запису про право власності / довірчої власності: 9394772
Тип права власності:    Право власності
Форма власності:        приватна
Розмір частки:          1/1
Власники:               Першина Наталія Миколаївна

                                  ВІДОМОСТІ
                З РЕЄСТРУ ПРАВ ВЛАСНОСТІ НА НЕРУХОМЕ МАЙНО


                                         стор. 6 з 13



                                                                                      RRP-4HINQBNHS
                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      1791091
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 37
Загальна площа (кв.м): 56,4, Житлова площа (кв.м): 38,0

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    23.08.2003
ПІБ:                     Краснощоков Петро Михайлович
Форма власності:         приватна
Частка власності:        1/2


Дата внесення запису:    23.08.2003
ПІБ:                     Краснощокова Валентина Павлівна
Форма власності:         приватна
Частка власності:        1/2

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      4034971
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 34
Загальна площа (кв.м): 41,8, Житлова площа (кв.м): 27,3

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    13.05.2004
ПІБ:                     Безуглий Сергій Віталійович
Форма власності:         приватна
Частка власності:        1/1

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      4366408
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 9
Загальна площа (кв.м): 44,4, Житлова площа (кв.м): 27,2

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    19.06.2007
ПІБ:                     Щербина Віктор Миколайович

                                         стор. 7 з 13



                                                                                      RRP-4HINQBNHS
Форма власності:         приватна
Частка власності:        1/1

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      7410060
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 10
Загальна площа (кв.м): 45,1, Житлова площа (кв.м): 27,2

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    06.03.2006
ПІБ:                     Коваленко Тетяна Михайлівна
Форма власності:         приватна
Частка власності:        1/2


Дата внесення запису:    06.03.2006
ПІБ:                     Коваленко Станіслав Володимирович
Форма власності:         приватна
Частка власності:        1/2

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      8809121
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 11
Загальна площа (кв.м): 41,9, Житлова площа (кв.м): 25,1

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    07.06.2012
ПІБ:                     П'ятигорська Наталія Володимирівна
Форма власності:         приватна
Частка власності:        1/1

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      9193712
майна:
Тип майна:               нежиле приміщення
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, приміщення 23
Загальна площа (кв.м): 44,2

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ

                                         стор. 8 з 13



                                                                                      RRP-4HINQBNHS
Дата внесення запису:    11.01.2012
ПІБ:                     Кукушкін Сергій Володимирович
Форма власності:         приватна

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      13094385
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 27
Загальна площа (кв.м): 46,5, Житлова площа (кв.м): 27,9

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    03.05.2006
ПІБ:                     Мардась Тамара Михайлівна
Форма власності:         приватна
Частка власності:        2/4

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      13344207
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 38
Загальна площа (кв.м): 42,3, Житлова площа (кв.м): 25,5

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    22.12.2005
ПІБ:                     Асабов Микола Семенович
Форма власності:         приватна
Частка власності:        1/1

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      19463116
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 1
Загальна площа (кв.м): 44,1, Житлова площа (кв.м): 28,0

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    24.09.2012
ПІБ:                     Піхотін Микола Олегович
Форма власності:         приватна
Частка власності:        1/1

                                         стор. 9 з 13



                                                                                      RRP-4HINQBNHS
                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      19622214
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 33
Загальна площа (кв.м): 55,7, Житлова площа (кв.м): 37,6

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    09.01.2012
ПІБ:                     Дроненко Віктор Анатолійович
Форма власності:         приватна
Частка власності:        1/1

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      21570323
майна:
Тип майна:               офіс
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, приміщення 2
Загальна площа (кв.м): 45,0

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    03.07.2012
ПІБ:                     Піхотін Микола Олегович
Форма власності:         приватна

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      22092376
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 40
Загальна площа (кв.м): 44,9, Житлова площа (кв.м): 29,9

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    12.02.2008
ПІБ:                     Кривдюк Олександр Миколайович
Форма власності:         приватна
Частка власності:        1/2


Дата внесення запису:    12.02.2008
ПІБ:                     Кривдюк Андрій Миколайович
Форма власності:         приватна

                                        стор. 10 з 13



                                                                                      RRP-4HINQBNHS
Частка власності:        1/2

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      24579031
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 4
Загальна площа (кв.м): 54,8, Житлова площа (кв.м): 37,4

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    29.10.2008
ПІБ:                     Білогур Белла Зіновіївна
Форма власності:         приватна
Частка власності:        1/1

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      27079362
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 30
Загальна площа (кв.м): 42,5, Житлова площа (кв.м): 25,4

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    18.06.2009
ПІБ:                     Маштак Євгеній Олегович
Форма власності:         приватна
Частка власності:        1/1

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      27484425
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 21
Загальна площа (кв.м): 55,6, Житлова площа (кв.м): 37,9

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    27.08.2009
ПІБ:                     Садчикова Ірина Вікторівна
Форма власності:         приватна
Частка власності:        1/1

                    ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА


                                        стор. 11 з 13



                                                                                      RRP-4HINQBNHS
Реєстраційний номер      30670860
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 3
Загальна площа (кв.м): 41,1, Житлова площа (кв.м): 24,7

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    19.07.2010
ПІБ:                     Шитіков Іван Михайлович
Форма власності:         приватна
Частка власності:        40/100


Дата внесення запису:    19.07.2010
ПІБ:                     Горькова Людмила Філаретівна
Форма власності:         приватна
Частка власності:        30/100


Дата внесення запису:    19.07.2010
ПІБ:                     Шитіков Михайло Федорович
Форма власності:         приватна
Частка власності:        30/100

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      33312266
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 17
Загальна площа (кв.м): 44,7, Житлова площа (кв.м): 29,8

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    01.04.2011
ПІБ:                     Найчук Вікторія Володимирівна
Форма власності:         приватна
Частка власності:        1/2


Дата внесення запису:    01.04.2011
ПІБ:                     Найчук Роман Сергійович
Форма власності:         приватна
Частка власності:        1/2

                   ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА

                                        стор. 12 з 13



                                                                                      RRP-4HINQBNHS
Реєстраційний номер      33716125
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 32
Загальна площа (кв.м): 44,3, Житлова площа (кв.м): 24,2

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    22.06.2011
ПІБ:                     Макєєв Артем Ігоревич
Форма власності:         приватна
Частка власності:        1/2


Дата внесення запису:    22.06.2011
ПІБ:                     Крот Анна Сергіївна
Форма власності:         приватна
Частка власності:        1/2

                  ВІДОМОСТІ ПРО ОБ’ЄКТ НЕРУХОМОГО МАЙНА
Реєстраційний номер      34838799
майна:
Тип майна:               квартира
Адреса нерухомого        Дніпропетровська обл., м. Дніпропетровськ, проспект Газети
майна:                   "Правда", будинок 64, квартира 29
Загальна площа (кв.м): 56,1, Житлова площа (кв.м): 37,8

                         ВІДОМОСТІ ПРО ПРАВА ВЛАСНОСТІ
Дата внесення запису:    19.12.2011
ПІБ:                     Левченко Віктор Леонідович
Форма власності:         приватна
Частка власності:        1/1


Інформаційну довідку     заступник начальника Мазур Наталія Іванівна
сформував:




                                        стор. 13 з 13



                                                                                      RRP-4HINQBNHS

"""


def pdf2txt(file_content):
    content = base64.b64encode(file_content).decode('utf-8')
    result = requests.post(url=START_CONVERSION_URL,
                           data=json.dumps({"apikey": API_KEY, "input": "base64", "file": content,
                                            "filename": "in.pdf", "outputformat": "file_content"}))

    if result.status_code != 200:
        raise Exception(result.text)

    data = result.json()['data']
    id = data['id']
    print(f"Start conversion response: {data}")

    while True:
        print(f"Start sleeping for {SLEEP_TIME} seconds")
        sleep(SLEEP_TIME)

        result = requests.get(url=GET_CONVERSION_STATUS_URL.format(id=id))
        if result.status_code != 200:
            raise Exception(result.text)

        data = result.json()['data']
        print(f"Conversion status response: {data}")

        if data['step'] == 'finish':
            break

    result = requests.get(url=GET_CONVERTED_FILE_URL.format(id=id))
    if result.status_code != 200:
        raise Exception(result.text)

    data = result.json()['data']
    if data.get('error'):
        print(f"Conversion error: {data.get('error')}")
        raise Exception(data.get('error'))

    return base64.b64decode(data['content']).decode('utf-8')


def txt2dict(file_content: str):
    def _cut_starts(data, templates):
        for template in templates:
            if template in data:
                return data[data.index(template):]
        return data

    def _skip_unneeded_items(record, unneeded_items):
        result_record = []
        for line in record:

            new_line = []
            for block in line:
                skip_block = any(filter(lambda x: (x in block) or (not block.strip()), unneeded_items))
                if skip_block:
                    continue
                new_line.append(block)

            result_record.append(new_line)

        return result_record

    def _cleanup_record(record):
        result_record = []
        for line in record:
            new_line = [block for block in line if block.strip()]
            if new_line:
                result_record.append(new_line)

        return result_record

    def _build_dict_record(record):
        main_info_block = record[0]

        key_parts = [item[:item.index(':') + 1].strip() if ':' in item else item[:25].strip() for item in main_info_block]
        value_parts = [item[item.index(':') + 1:].strip() if ':' in item else item[25:].strip() for item in main_info_block]

        key_index = 0
        key = ''
        keys = []
        for key_part in key_parts:
            key_index += 1
            key += key_part + ' '
            if ':' in key_part:
                keys.append((key.strip(), key_index))
                key = ''
                key_index = 0

        if key:
            keys.append((key.strip(), key_index))

        fixed_keys = []

        offset = 0
        for index in range(len(keys)-1, -1, -1):
            if not keys[index][0]:
                offset += 1
            else:
                fixed_keys.append((keys[index][0], keys[index][1] + offset))
                offset = 0

        record[0] = {}

        index = 0
        fixed_keys.reverse()
        for key, cnt in fixed_keys:
            record[0][key] = ' '.join(value_parts[index:index+cnt])
            index += cnt

        return record

    def _build_dict_records(records):
        return [_build_dict_record(record) for record in records]

    for from_what, to_what in to_replace.items():
        file_content = file_content.replace(from_what, to_what)

    file_content = file_content.split(level_1_destination_delimiter)[1:]

    records = []

    for block in file_content:
        data = block.split(level_2_destination_delimiter)

        record = [_cut_starts(data[0], main_info_starts).split('\n'),
                  *[_cut_starts(owner, own_info_starts).split('\n') for owner in data[1:]]]

        record = _skip_unneeded_items(record, skippers)
        record = _cleanup_record(record)
        if record:
            records.append(record)

    records = _build_dict_records(records)

    for record in records:
        record[0] = {key_substitution.get(key, key):value for key, value in record[0].items()}
        record[0]['Власники'] = chr(10).join(chain(*record[1:]))
        del record[1]

    return [record[0] for record in records]


with open('out.csv', 'w') as file_csv:
    file_content = txt2dict(test_data)
    writer = csv.DictWriter(file_csv, fieldnames=csv_keys, quoting=csv.QUOTE_ALL)
    writer.writerows(file_content)
